app/views/post/drafts.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
          <span id = "post_id"><%= post.id %></span>
          <td><%= User.find(post.owner_id).name %></td>