app/views/post/published.html.erb

          <span id = "post_id"><%= post.id %></span>
          <td><%= User.find(post.owner_id).name %></td>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1