app/controllers/post_controller.rb

  def index
    @posts = current_user ? (current_user.is_admin? ? Post.all : (Post.published + current_user.posts)) : Post.published
---
SELECT `posts`.* FROM `posts` WHERE (draft = 0)

  def publish_draft
    post = Post.find(params["post_id"].to_i)
    post.draft = false
    post.save!
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 4 LIMIT 1
UPDATE `posts` SET `draft` = 0, `updated_at` = '2013-06-19 20:01:53' WHERE `posts`.`id` = 4

  def show
    post = Post.find(params["id"].to_i)
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 5 LIMIT 1