app/controllers/registrations_controller.rb

INSERT INTO `users` (`created_at`, `current_sign_in_at`, `current_sign_in_ip`, `email`, `encrypted_password`, `last_sign_in_at`, `last_sign_in_ip`, `name`, `remember_created_at`, `reset_password_sent_at`, `reset_password_token`, `sign_in_count`, `updated_at`, `username`) VALUES ('2013-06-19 13:14:05', NULL, NULL, 'sh2@gjahsd.com', '$2a$10$BioEaxxBOpi237lJR0ZrheuFOkGVY1oCa8QGgRJXFsksSriLt/V1q', NULL, NULL, 'Shanil Puri', NULL, NULL, NULL, 0, '2013-06-19 13:14:05', NULL)
SELECT `roles`.* FROM `roles` WHERE `roles`.`name` = 'Reporter' LIMIT 1
---
  def create
    @user = User.create(params["user"])
    @user.roles << Role.find_by_name("JobSeeker")